---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkCanNotDeterminCriticalPath
source: html/3c14f25b-981f-0bfa-07a4-87a54d0df94d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkCanNotDeterminCriticalPath Property

The calculation has completed, but there may be an error in determining the critical path. Verify that demand flow is specified for all required elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; }
```